20MB/test1-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   224.098 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.13 [#/sec] (mean)
Time per request:       7469.944 [ms] (mean)
Time per request:       7469.944 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3532.12 kb/s sent
                        3532.15 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6212 7470 1037.5   7315   10028
Waiting:     4822 6037 1026.5   5941    8564
Total:       6212 7470 1037.5   7316   10028

Percentage of the requests served within a certain time (ms)
  50%   7316
  66%   7679
  75%   7953
  80%   8207
  90%   9688
  95%   9749
  98%  10028
  99%  10028
 100%  10028 (longest request)