20MB/test1-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   261.935 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.11 [#/sec] (mean)
Time per request:       8731.154 [ms] (mean)
Time per request:       8731.154 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3021.91 kb/s sent
                        3021.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6081 8731 1987.3   8280   13972
Waiting:     4692 7280 1937.6   6793   12549
Total:       6081 8731 1987.3   8280   13973

Percentage of the requests served within a certain time (ms)
  50%   8280
  66%   9377
  75%   9697
  80%   9788
  90%  11553
  95%  13620
  98%  13973
  99%  13973
 100%  13973 (longest request)