20MB/test10-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   237.694 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.13 [#/sec] (mean)
Time per request:       7923.124 [ms] (mean)
Time per request:       7923.124 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3330.10 kb/s sent
                        3330.13 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6090 7923 1196.2   8013   11827
Waiting:     4539 6401 1168.6   6184   10328
Total:       6090 7923 1196.1   8013   11827

Percentage of the requests served within a certain time (ms)
  50%   8013
  66%   8256
  75%   8505
  80%   8818
  90%   9450
  95%   9690
  98%  11827
  99%  11827
 100%  11827 (longest request)