20MB/test2-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   255.478 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.12 [#/sec] (mean)
Time per request:       8515.926 [ms] (mean)
Time per request:       8515.926 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3098.28 kb/s sent
                        3098.31 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:  5969 8516 2596.2   7811   17863
Waiting:     4643 6952 2499.3   6287   16450
Total:       5969 8516 2596.2   7812   17864

Percentage of the requests served within a certain time (ms)
  50%   7812
  66%   8372
  75%   9112
  80%  10276
  90%  11579
  95%  14843
  98%  17864
  99%  17864
 100%  17864 (longest request)