20MB/test2-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        22088 bytes

Concurrency Level:      1
Time taken for tests:   2.336 seconds
Complete requests:      1
Failed requests:        0
Non-2xx responses:      1
Total transferred:      22280 bytes
Total body sent:        20000181
HTML transferred:       22088 bytes
Requests per second:    0.43 [#/sec] (mean)
Time per request:       2336.442 [ms] (mean)
Time per request:       2336.442 [ms] (mean, across all concurrent requests)
Transfer rate:          9.31 [Kbytes/sec] received
                        8359.47 kb/s sent
                        8368.79 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        6    6   0.0      6       6
Processing:  2330 2330   0.0   2330    2330
Waiting:      315  315   0.0    315     315
Total:       2336 2336   0.0   2336    2336