20MB/test2-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        22088 bytes

Concurrency Level:      1
Time taken for tests:   2.024 seconds
Complete requests:      1
Failed requests:        0
Non-2xx responses:      1
Total transferred:      22280 bytes
Total body sent:        20000181
HTML transferred:       22088 bytes
Requests per second:    0.49 [#/sec] (mean)
Time per request:       2024.231 [ms] (mean)
Time per request:       2024.231 [ms] (mean, across all concurrent requests)
Transfer rate:          10.75 [Kbytes/sec] received
                        9648.81 kb/s sent
                        9659.56 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        5    5   0.0      5       5
Processing:  2020 2020   0.0   2020    2020
Waiting:      302  302   0.0    302     302
Total:       2024 2024   0.0   2024    2024