20MB/test3-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        22088 bytes

Concurrency Level:      1
Time taken for tests:   139.212 seconds
Complete requests:      30
Failed requests:        0
Non-2xx responses:      30
Total transferred:      668400 bytes
Total body sent:        600005430
HTML transferred:       662640 bytes
Requests per second:    0.22 [#/sec] (mean)
Time per request:       4640.406 [ms] (mean)
Time per request:       4640.406 [ms] (mean, across all concurrent requests)
Transfer rate:          4.69 [Kbytes/sec] received
                        4208.99 kb/s sent
                        4213.68 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   10   4.9      8      22
Processing:  2190 4631 1933.3   3968   10066
Waiting:       81  247 171.2    193     773
Total:       2198 4640 1935.3   3985   10082

Percentage of the requests served within a certain time (ms)
  50%   3985
  66%   5177
  75%   5569
  80%   6451
  90%   7625
  95%   7670
  98%  10082
  99%  10082
 100%  10082 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient)...This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient)...