20MB/test3-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   233.771 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.13 [#/sec] (mean)
Time per request:       7792.356 [ms] (mean)
Time per request:       7792.356 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3385.98 kb/s sent
                        3386.01 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6120 7792 1032.6   7592   10384
Waiting:     4744 6294 1035.0   6029    8857
Total:       6120 7792 1032.6   7593   10385

Percentage of the requests served within a certain time (ms)
  50%   7593
  66%   7886
  75%   8115
  80%   8769
  90%   9404
  95%  10034
  98%  10385
  99%  10385
 100%  10385 (longest request)